       FD  F-:CLIENT:
           RECORD CONTAINS 77 TO 100 CHARACTERS
           RECORDING MODE IS V.

       01  R:CLIENT:.
	       03 R:CLIENT:-ID      PIC X(09).
           03 R:CLIENT:-NOM     PIC X(20).
           03 R:CLIENT:-PRENOM  PIC X(20).
           03 R:CLIENT:-POSTE   PIC X(14).
           03 R:CLIENT:-CODE    PIC X(03).
           03 R:CLIENT:-SALAIRE PIC X(06).
           03 R:CLIENT:-AGENCE  PIC X(05).

