      ******************************************************************
      ******************************************************************

       IDENTIFICATION DIVISION.
       PROGRAM-ID. myprog.
       AUTHOR.   YourName.


      ******************************************************************

       PROCEDURE DIVISION.
       0000-START-MAIN.
           CALL "yourSubprogramName".
       END-0000-MAIN.
           GOBACK.
