       FD  F-:CLIENT:
           RECORDING MODE IS F.

       01  R:CLIENT:.
	       03 R:CLIENT:-ID      PIC X(8).
           03 R:CLIENT:-NOM     PIC X(20).
           03 R:CLIENT:-PRENOM  PIC X(20).
           03 R:CLIENT:-POSTE   PIC X(14).
           03 R:CLIENT:-SALAIRE PIC X(7).
           03 R:CLIENT:-AGENCE  PIC X(3).

