       FD  F-DEPT
           RECORD CONTAINS 51 CHARACTERS
           RECORDING MODE IS F.

       01  RDEPT.
           03 RDEPT-ID      PIC X(3).
           03 RDEPT-DEP     PIC X(23).
           03 RDEPT-REGION  PIC X(26). 
