      ******************************************************************
      ******************************************************************

       IDENTIFICATION DIVISION.
       PROGRAM-ID. main.
       AUTHOR.     Rémi.

      ******************************************************************

       PROCEDURE DIVISION.
       0000-START-MAIN.
           CALL "yourSubprogramName".

           DISPLAY "HELLO COBOL".
       END-0000-MAIN.
           STOP RUN.
