      ******************************************************************
      ******************************************************************

       IDENTIFICATION DIVISION.
       PROGRAM-ID. main.
       AUTHOR.     Rémi.

      ******************************************************************

       PROCEDURE DIVISION.
       0000-START-MAIN.
               CALL "signin".
       END-0000-MAIN.
           STOP RUN.
